In [1]:
import pandas as pd

In [2]:
url = "https://raw.githubusercontent.com/ledeprogram/courses/master/foundations/mapping/tilemill/yelp-lunch-nyc.csv"
df = pd.read_csv(url)

In [3]:
import sqlite3

In [4]:
conn = sqlite3.connect('restaurants.db')

In [8]:
cursor = conn.cursor()

In [5]:
df.to_sql('restaurants', conn, index = False)

In [10]:
cursor.execute('select * from restaurants LIMIT 1;')

In [11]:
cursor.fetchall()

[('Rambling House',
  '4292 Katonah Ave',
  'Bronx',
  'Pubs',
  4.0,
  'http://www.yelp.com/biz/rambling-house-bronx')]

In [12]:
pd.read_sql("select * from restaurants LIMIT 1;",conn)

,Name,Address,City,Category,Rating,URL
0,Rambling House,4292 Katonah Ave,Bronx,Pubs,4.0,http://www.yelp.com/biz/rambling-house-bronx

In [13]:
pd.read_sql("select count(*) from restaurants;",conn)

   count(*)
0      5811

In [19]:
pd.read_sql("select CITY, count(*) as count from restaurants GROUP BY CITY order by count DESC LIMIT 10;",conn)

            City  count
0       Brooklyn   1282
1       New York   1149
2  Staten Island   1034
3          Bronx    817
4       Flushing    161
5        Jamaica    145
6   Forest Hills     97
7        Astoria     92
8        Bayside     70
9  Rockaway Park     59

In [27]:
pd.read_sql("select CITY, count(*) as count from restaurants GROUP BY CITY having count > 100 order by count DESC LIMIT 3;",conn)

            City  count
0       Brooklyn   1282
1       New York   1149
2  Staten Island   1034

In [29]:
pd.read_sql("PRAGMA table_info('restaurants')", conn)

   cid      name  type  notnull dflt_value  pk
0    0      Name  TEXT        0       None   0
1    1   Address  TEXT        0       None   0
2    2      City  TEXT        0       None   0
3    3  Category  TEXT        0       None   0
4    4    Rating  REAL        0       None   0
5    5       URL  TEXT        0       None   0

In [30]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)

          name
0  restaurants